[
  {
    "Company": "Samsung",
    "modelName": "S23 Ultra",
    "imageUrl": "https://m.media-amazon.com/images/I/31W9+sE8McL._SY300_SX300_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/51hqXIAVXAL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy S23 Ultra is a premium smartphone that offers a stunning display, a powerful performance, and a remarkable camera system. It is the successor of the Galaxy S21 Ultra, and it comes with several improvements and new features that make it one of the best Android phones of 2023.<br><br>The Galaxy S23 Ultra has a 6.8-inch Dynamic AMOLED 2X screen with a resolution of 1440 x 3088 pixels and a 120Hz refresh rate. The display supports HDR10+ and has a peak brightness of 1750 nits, making it ideal for watching videos and playing games. The screen is also protected by Corning Gorilla Glass Victus 2, which is more resistant to drops and scratches than the previous generation. The phone also has an in-display fingerprint sensor and an S Pen stylus that can be used for taking notes, drawing, and controlling the device.<br><br>The Galaxy S23 Ultra is powered by the Qualcomm Snapdragon 8 Gen 2 chipset, which is a custom-tuned version of the Snapdragon 898 for Samsung. The chipset has an octa-core CPU with a 3.36 GHz Cortex-X3 core, two 2.8 GHz Cortex-A715 cores, two 2.8 GHz Cortex-A710 cores, and three 2.0 GHz Cortex-A510 cores. The chipset also has an Adreno 740 GPU and a 4 nm process technology, making it one of the fastest and most efficient processors on the market. The phone comes with 8 GB or 12 GB of RAM and 256 GB, 512 GB, or 1 TB of UFS 4.0 storage, which is faster and more reliable than the previous generation.<br><br>The Galaxy S23 Ultra has a quad-camera setup on the back, consisting of a 200 MP main camera, a 10 MP periscope telephoto camera with 10x optical zoom, a 10 MP telephoto camera with 3x optical zoom, and a 12 MP ultrawide camera. The main camera has a multi-directional PDAF, laser AF, and OIS, and it can capture stunning photos and videos in any lighting condition. The phone can also record 8K videos at 24 or 30 fps, 4K videos at 30 or 60 fps, and 1080p videos at up to 960 fps. The front-facing camera is a 12 MP dual-pixel sensor that can take selfies, make video calls, and support dual video recording and HDR10+.<br><br>The Galaxy S23 Ultra has a 5000 mAh battery that supports 45W fast charging, 15W wireless charging, and 4.5W reverse wireless charging. The phone also has a range of connectivity options, such as Wi-Fi 6E, Bluetooth 5.3, NFC, GPS, and 5G. The phone runs on Android 13 with One UI 6, which is Samsung's custom skin that offers a smooth and intuitive user experience. The phone also has some exclusive features, such as Samsung DeX, which allows the phone to be used as a desktop computer, and Samsung Pay, which enables secure and convenient mobile payments.",
    "amount": 1199,
    "base": "USD",
    "quantity": 30
  },
  {
    "Company": "Samsung",
    "modelName": "S23",
    "imageUrl": "https://rukminim2.flixcart.com/image/416/416/xif0q/mobile/1/r/n/-original-imagmg6gyzgzzszt.jpeg?q=70",
    "addImageUrl": "https://m.media-amazon.com/images/I/61OvxXhQgZL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy S23 is a flagship smartphone that offers a sleek design, a powerful performance, and a versatile camera system. It is the successor of the Galaxy S22, and it comes with several improvements and new features that make it one of the best Android phones of 2023.<br><br>The Galaxy S23 has a 6.1-inch Dynamic AMOLED 2X screen with a resolution of 1440 x 3088 pixels and a 120Hz refresh rate. The display supports HDR10+ and has a peak brightness of 1750 nits, making it ideal for watching videos and playing games. The screen is also protected by Corning Gorilla Glass Victus 2, which is more resistant to drops and scratches than the previous generation. The phone also has an in-display fingerprint sensor and an S Pen stylus that can be used for taking notes, drawing, and controlling the device.<br><br>The Galaxy S23 is powered by the Qualcomm Snapdragon 8 Gen 2 chipset, which is a custom-tuned version of the Snapdragon 898 for Samsung. The chipset has an octa-core CPU with a 3.36 GHz Cortex-X3 core, two 2.8 GHz Cortex-A715 cores, two 2.8 GHz Cortex-A710 cores, and three 2.0 GHz Cortex-A510 cores. The chipset also has an Adreno 740 GPU and a 4 nm process technology, making it one of the fastest and most efficient processors on the market. The phone comes with 8 GB of RAM and 256 GB or 512 GB of UFS 4.0 storage, which is faster and more reliable than the previous generation.<br><br>The Galaxy S23 has a triple-camera setup on the back, consisting of a 50 MP main camera, a 10 MP telephoto camera with 3x optical zoom, and a 12 MP ultrawide camera. The main camera has a multi-directional PDAF, laser AF, and OIS, and it can capture stunning photos and videos in any lighting condition. The phone can also record 8K videos at 24 or 30 fps, 4K videos at 30 or 60 fps, and 1080p videos at up to 960 fps. The front-facing camera is a 12 MP dual-pixel sensor that can take selfies, make video calls, and support dual video recording and HDR10+.<br><br>The Galaxy S23 has a 3900 mAh battery that supports 45W fast charging, 15W wireless charging, and 4.5W reverse wireless charging. The phone also has a range of connectivity options, such as Wi-Fi 6E, Bluetooth 5.3, NFC, GPS, and 5G. The phone runs on Android 13 with One UI 6, which is Samsung's custom skin that offers a smooth and intuitive user experience. The phone also has some exclusive features, such as Samsung DeX, which allows the phone to be used as a desktop computer, and Samsung Pay, which enables secure and convenient mobile payments.",
    "amount": 799,
    "base": "USD",
    "quantity": 25
  },
  {
    "Company": "Samsung",
    "modelName": "S22 Ultra",
    "imageUrl": "https://m.media-amazon.com/images/I/51ImByT01SL._SX679_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/71J8tz0UeJL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy S22 Ultra is a flagship smartphone that offers a sleek design, a powerful performance, and a versatile camera system. It is the successor of the Galaxy S21 Ultra, and it comes with several improvements and new features that make it one of the best Android phones of 2022.<br><br>The Galaxy S22 Ultra has a 6.8-inch Dynamic AMOLED 2X screen with a resolution of 1440 x 3088 pixels and a 120Hz refresh rate. The display supports HDR10+ and has a peak brightness of 1750 nits, making it ideal for watching videos and playing games. The screen is also protected by Corning Gorilla Glass Victus 2, which is more resistant to drops and scratches than the previous generation. The phone also has an in-display fingerprint sensor and an S Pen stylus that can be used for taking notes, drawing, and controlling the device.<br><br>The Galaxy S22 Ultra is powered by the Qualcomm Snapdragon 8 Gen 2 chipset, which is a custom-tuned version of the Snapdragon 898 for Samsung. The chipset has an octa-core CPU with a 3.36 GHz Cortex-X3 core, two 2.8 GHz Cortex-A715 cores, two 2.8 GHz Cortex-A710 cores, and three 2.0 GHz Cortex-A510 cores. The chipset also has an Adreno 740 GPU and a 4 nm process technology, making it one of the fastest and most efficient processors on the market. The phone comes with 12 GB of RAM and 256 GB or 512 GB of UFS 4.0 storage, which is faster and more reliable than the previous generation.<br><br>The Galaxy S22 Ultra has a quad-camera setup on the back, consisting of a 108 MP main camera, a 10 MP periscope telephoto camera with 10x optical zoom, a 10 MP telephoto camera with 3x optical zoom, and a 12 MP ultrawide camera. The main camera has a multi-directional PDAF, laser AF, and OIS, and it can capture stunning photos and videos in any lighting condition. The phone can also record 8K videos at 24 or 30 fps, 4K videos at 30 or 60 fps, and 1080p videos at up to 960 fps. The front-facing camera is a 40 MP dual-pixel sensor that can take selfies, make video calls, and support dual video recording and HDR10+.<br><br>The Galaxy S22 Ultra has a 5000 mAh battery that supports 45W fast charging, 15W wireless charging, and 4.5W reverse wireless charging. The phone also has a range of connectivity options, such as Wi-Fi 6E, Bluetooth 5.3, NFC, GPS, and 5G. The phone runs on Android 12 with One UI 6, which is Samsung's custom skin that offers a smooth and intuitive user experience. The phone also has some exclusive features, such as Samsung DeX, which allows the phone to be used as a desktop computer, and Samsung Pay, which enables secure and convenient mobile payments.",
    "amount": 614,
    "base": "USD",
    "quantity": 25
  },
  {
    "Company": "Samsung",
    "modelName": "S22",
    "imageUrl": "https://rukminim2.flixcart.com/image/416/416/xif0q/mobile/w/s/e/-original-imaggj68ync6sywg.jpeg?q=70",
    "addImageUrl": "https://rukminim2.flixcart.com/image/312/312/xif0q/mobile/5/r/x/-original-imagth5xf4shxcuv.jpeg?q=70",
    "description": "The Samsung Galaxy S22 is a flagship smartphone that offers a sleek design, a powerful performance, and a versatile camera system. It is the successor of the Galaxy S21, and it comes with several improvements and new features that make it one of the best Android phones of 2022.<br><br>The Galaxy S22 has a 6.1-inch Dynamic AMOLED 2X screen with a resolution of 1440 x 3088 pixels and a 120Hz refresh rate. The display supports HDR10+ and has a peak brightness of 1750 nits, making it ideal for watching videos and playing games. The screen is also protected by Corning Gorilla Glass Victus 2, which is more resistant to drops and scratches than the previous generation. The phone also has an in-display fingerprint sensor and an S Pen stylus that can be used for taking notes, drawing, and controlling the device.<br><br>The Galaxy S22 is powered by the Qualcomm Snapdragon 8 Gen 2 chipset, which is a custom-tuned version of the Snapdragon 898 for Samsung. The chipset has an octa-core CPU with a 3.36 GHz Cortex-X3 core, two 2.8 GHz Cortex-A715 cores, two 2.8 GHz Cortex-A710 cores, and three 2.0 GHz Cortex-A510 cores. The chipset also has an Adreno 740 GPU and a 4 nm process technology, making it one of the fastest and most efficient processors on the market. The phone comes with 8 GB of RAM and 128 GB or 256 GB of UFS 4.0 storage, which is faster and more reliable than the previous generation.<br><br>The Galaxy S22 has a triple-camera setup on the back, consisting of a 50 MP main camera, a 10 MP telephoto camera with 3x optical zoom, and a 12 MP ultrawide camera. The main camera has a multi-directional PDAF, laser AF, and OIS, and it can capture stunning photos and videos in any lighting condition. The phone can also record 8K videos at 24 or 30 fps, 4K videos at 30 or 60 fps, and 1080p videos at up to 960 fps. The front-facing camera is a 10 MP dual-pixel sensor that can take selfies, make video calls, and support dual video recording and HDR10+.<br><br>The Galaxy S22 has a 3700 mAh battery that supports 45W fast charging, 15W wireless charging, and 4.5W reverse wireless charging. The phone also has a range of connectivity options, such as Wi-Fi 6E, Bluetooth 5.3, NFC, GPS, and 5G. The phone runs on Android 12 with One UI 6, which is Samsung's custom skin that offers a smooth and intuitive user experience. The phone also has some exclusive features, such as Samsung DeX, which allows the phone to be used as a desktop computer, and Samsung Pay, which enables secure and convenient mobile payments.",
    "amount": 727,
    "base": "USD",
    "quantity": 35
  },
  {
    "Company": "Samsung",
    "modelName": "S21 Ultra",
    "imageUrl": "https://m.media-amazon.com/images/I/510WhSJ1JTL._SX300_SY300_QL70_FMwebp_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/61ck-OpLBlL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy S21 Ultra is a flagship smartphone that exemplifies cutting-edge technology and innovation. Released in early 2021, this device stands out with its impressive features, stunning design, and powerful performance, making it a top choice for tech enthusiasts and professionals alike.<br><br>At the heart of the Galaxy S21 Ultra is the Exynos 2100/Snapdragon 888 processor, depending on the region. This powerful chipset ensures smooth and lag-free performance, handling demanding tasks effortlessly. Paired with either 8GB or 12GB of RAM, the S21 Ultra delivers a seamless multitasking experience, allowing users to run multiple apps simultaneously without a hitch.<br><br>The display of the S21 Ultra is a true highlight, featuring a 6.8-inch Dynamic AMOLED 2X panel with a WQHD+ resolution. Boasting vibrant colors, deep blacks, and a 120Hz refresh rate, the display provides a visually stunning experience whether you're gaming, streaming videos, or simply navigating the device. The HDR10+ support further enhances the viewing experience, making colors pop and details come to life.<br><br>Photography enthusiasts will appreciate the versatile and powerful camera system on the Galaxy S21 Ultra. The quad-camera setup on the rear includes a 108MP wide-angle lens, a 12MP ultra-wide lens, and two telephoto lenses with 10MP and 10MP resolutions. This sophisticated arrangement allows for 100x digital zoom, capturing details from afar with impressive clarity. The laser autofocus and phase detection autofocus ensure that your shots are sharp and focused, even in challenging conditions.<br><br>The S21 Ultra is a photography powerhouse, excelling in low-light conditions and offering a variety of shooting modes to cater to different preferences. The 40MP front-facing camera delivers stunning selfies, and the device supports 8K video recording, pushing the boundaries of mobile videography.<br><br>In terms of design, Samsung has opted for a sleek and sophisticated look with the S21 Ultra. The metal and glass construction not only gives the device a premium feel but also ensures durability. The camera bump on the rear is seamlessly integrated into the overall design, adding to the device's aesthetics. The S21 Ultra is available in a range of colors, allowing users to choose a variant that suits their style.",
    "amount": 449.5,
    "base": "USD",
    "quantity": 20
  },
  {
    "Company": "Samsung",
    "modelName": "S21",
    "imageUrl": "https://m.media-amazon.com/images/I/614n6dbzqtL._SX522_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/614n6dbzqtL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy S21, released in 2021, is a flagship smartphone that combines sleek design, powerful performance, and a versatile camera system. Catering to a wide range of users, the Galaxy S21 offers an impressive feature set that makes it a compelling choice in the competitive smartphone market.<br><br>At the core of the Galaxy S21 is the Exynos 2100/Snapdragon 888 processor (depending on the region), ensuring snappy and responsive performance. With either 8GB or 12GB of RAM, users can expect smooth multitasking and efficient app handling. The S21 is equipped with either 128GB or 256GB of internal storage, providing ample space for apps, photos, and videos.<br><br>The device sports a 6.2-inch Dynamic AMOLED 2X display with a Full HD+ resolution. The 120Hz refresh rate contributes to a smooth and fluid user experience, whether you're scrolling through social media, gaming, or watching videos. The HDR10+ support enhances color accuracy and contrast, delivering vibrant and lifelike visuals.<br><br>In the camera department, the Galaxy S21 features a triple-lens setup on the rear. The 12MP wide-angle lens, 12MP ultra-wide lens, and 64MP telephoto lens work together to capture a variety of shots with clarity and detail. The 3x hybrid zoom and 8K video recording capabilities add versatility to the camera system. On the front, a 10MP selfie camera produces clear and vibrant self-portraits.<br><br>The design of the Galaxy S21 is modern and sophisticated, with a glass back and a metal frame. The camera module on the rear seamlessly integrates into the overall design, giving the device a cohesive and premium look. The S21 is available in a range of attractive colors, allowing users to express their personal style.<br><br>Running on Samsung's One UI 3.1, based on Android 11, the Galaxy S21 provides a user-friendly interface with a host of customization options. The 4,000mAh battery ensures a full day of usage, and the device supports fast wired and wireless charging for added convenience.<br><br>One notable feature of the Galaxy S21 is its 5G capability, enabling users to experience faster download and streaming speeds where 5G networks are available. The S21 is also water and dust resistant, with an IP68 rating, providing durability and peace of mind in various environments.",
    "amount": 224,
    "base": "USD",
    "quantity": 20
  },
  {
    "Company": "Samsung",
    "modelName": "S21+",
    "imageUrl": "https://m.media-amazon.com/images/I/41izRp8pfUL._SX300_SY300_QL70_FMwebp_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/91qrsV9uS-L._AC_UY218_.jpg",
    "description": "The Samsung Galaxy S21+ stands as a flagship smartphone, striking a balance between power, performance, and sleek design. As part of the Galaxy S21 series, this device is a testament to Samsung's commitment to innovation, delivering a feature-rich experience for users who demand top-tier capabilities from their smartphones.<br><br>At the core of the Galaxy S21+ is the Exynos 2100/Snapdragon 888 processor, depending on the region. This powerful chipset, coupled with 8GB or 12GB of RAM, ensures that the S21+ can handle demanding tasks with ease, providing a smooth and responsive user experience. The device offers ample storage options, with variants featuring 128GB or 256GB of internal storage, catering to users with diverse needs for space.<br><br>The S21+ boasts a stunning 6.7-inch Dynamic AMOLED 2X display with a resolution of 2400 x 1080 pixels. This display not only delivers vibrant and sharp visuals but also supports a 120Hz refresh rate, enhancing the overall fluidity of the user interface. HDR10+ support ensures a high dynamic range, making colors pop and details stand out, whether you're gaming, watching videos, or simply navigating the device.<br><br>Photography enthusiasts will appreciate the triple-camera system on the rear of the S21+. The 12MP wide-angle lens, 12MP ultra-wide lens, and 64MP telephoto lens work in tandem to capture a wide range of scenes with precision and clarity. The device supports up to 8K video recording, pushing the boundaries of mobile videography. The 10MP front-facing camera ensures sharp and vibrant selfies, completing the S21+'s photography capabilities.<br><br>In terms of design, the Galaxy S21+ features a sleek and modern aesthetic. The metal frame seamlessly integrates with the glass back, and the camera module on the rear is part of the device's overall design, adding to its premium feel. The device is available in a range of attractive colors, allowing users to choose a variant that aligns with their personal style.<br><br>The S21+ runs on Samsung's One UI 3.1, based on Android 11, offering a user-friendly and feature-rich interface. Samsung's software experience includes various customization options, security features, and optimizations that enhance the overall user experience. The inclusion of features like wireless DeX and Samsung Knox underscores the device's capabilities for productivity and security.",
    "amount": 259,
    "base": "USD",
    "quantity": 44
  },
  {
    "Company": "Samsung",
    "modelName": "Note 20 Ultra",
    "imageUrl": "https://m.media-amazon.com/images/I/417GDoq1kGL._SX300_SY300_QL70_FMwebp_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/71eVZFpYUvL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy Note 20 Ultra is a powerhouse flagship smartphone that seamlessly combines cutting-edge technology, an expansive display, a sophisticated design, and the iconic S Pen functionality. As part of the esteemed Galaxy Note series, the Note 20 Ultra is tailored for users who demand the absolute best in terms of performance, productivity, and creativity.<br><br>At the heart of the Galaxy Note 20 Ultra lies the Exynos 990/Snapdragon 865+ processor, delivering an exceptional level of performance that can effortlessly handle demanding tasks. Coupled with a generous 12GB of RAM, the device ensures smooth multitasking, allowing users to seamlessly switch between applications without compromising performance. The internal storage options of 256GB or 512GB provide ample space for apps, media, and files, catering to users with diverse storage needs.<br><br>The Note 20 Ultra features a stunning 6.9-inch Dynamic AMOLED display with a resolution of 3088 x 1440 pixels. The edge-to-edge design and the near bezel-less display not only contribute to an immersive viewing experience but also support a buttery-smooth 120Hz refresh rate for seamless interactions and animations. The HDR10+ certification enhances color accuracy and contrast, making content appear vibrant and true to life.<br><br>A standout feature of the Galaxy Note series is the S Pen, and the Note 20 Ultra takes stylus functionality to new heights. The S Pen offers improved latency, making it incredibly responsive and precise. With features like Air Actions, users can control the device with gestures, adding a new dimension to productivity and creativity. The S Pen's integration with Samsung Notes and other apps provides a seamless digital note-taking and sketching experience.<br><br>Photography enthusiasts will be impressed by the Note 20 Ultra's sophisticated camera system. The triple-camera setup on the rear includes a massive 108MP wide-angle lens, a 12MP periscope telephoto lens with 5x optical zoom, and a 12MP ultra-wide lens. This versatile arrangement ensures that users can capture stunning shots in various scenarios, from wide landscapes to detailed close-ups. The laser autofocus and phase detection autofocus contribute to the camera's precision and speed.<br><br>On the front, a 10MP selfie camera with Dual Pixel autofocus ensures sharp and clear self-portraits. The Note 20 Ultra's camera capabilities extend to video recording, supporting 8K video capture for an unparalleled level of detail in your videos.",
    "amount": 431,
    "base": "USD",
    "quantity": 25
  },
  {
    "Company": "Samsung",
    "modelName": "Note 20",
    "imageUrl": "https://m.media-amazon.com/images/I/91IBNGEAhyL._SX679_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/91IBNGEAhyL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy Note 20 stands as a formidable flagship smartphone, offering a perfect blend of power, productivity features, and sleek design. As a member of the revered Galaxy Note series, the Note 20 caters to users who prioritize performance, creativity, and advanced functionalities in their mobile devices.<br><br>Driving the Galaxy Note 20 is the Exynos 990/Snapdragon 865+ processor, depending on the region. This potent chipset, coupled with 8GB of RAM, ensures that the device handles multitasking and demanding applications with finesse. The Note 20 provides ample storage space with options of 256GB, catering to users who require significant room for apps, media, and files.<br><br>The device sports a 6.7-inch Super AMOLED Plus display with a resolution of 2400 x 1080 pixels. Known for its vibrant colors and deep blacks, the Super AMOLED technology delivers an immersive visual experience. The display supports a 60Hz refresh rate, contributing to smooth interactions and responsiveness, making it ideal for gaming, media consumption, and productivity tasks.<br><br>An integral feature of the Galaxy Note series is the S Pen, and the Note 20 is no exception. The S Pen stylus offers a precise and responsive writing and drawing experience. With features like Air Actions, users can control the device through gestures, providing a unique and intuitive way to interact with the smartphone. The S Pen's integration with Samsung Notes and other apps enhances productivity and creativity, making it a valuable tool for professionals and artists alike.<br><br>In the camera department, the Galaxy Note 20 features a triple-camera setup on the rear. The 12MP wide-angle lens, 64MP telephoto lens, and 12MP ultra-wide lens provide a versatile photography experience, capturing detailed shots in various scenarios. The device supports 8K video recording, allowing users to create high-resolution videos with exceptional detail. The 10MP front-facing camera ensures sharp and clear selfies.<br><br>The design of the Note 20 reflects a modern and sophisticated aesthetic. The metal frame and Gorilla Glass 5 on the front and back not only add durability but also contribute to a premium look and feel. The camera module on the rear is elegantly integrated into the device's overall design, maintaining a sleek and cohesive appearance.",
    "amount": 269,
    "base": "USD",
    "quantity": 30
  },
  {
    "Company": "Samsung",
    "modelName": "Z Fold 3",
    "imageUrl": "https://m.media-amazon.com/images/I/71zDl128yGL._SL1500_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/71zDl128yGL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy Z Fold 3 is a revolutionary foldable smartphone that redefines the boundaries of mobile technology, seamlessly blending a compact form factor with expansive capabilities. As the latest iteration in the Galaxy Z Fold series, the Z Fold 3 stands as a testament to Samsung's commitment to innovation and pushing the limits of what a smartphone can offer.<br><br>At the core of the Galaxy Z Fold 3 is a cutting-edge processor – the Qualcomm Snapdragon 888. This powerhouse, coupled with 12GB of RAM, ensures that the device delivers a smooth and responsive user experience, whether you're multitasking, gaming, or running demanding applications. With 256GB or 512GB of internal storage, the Z Fold 3 caters to users who require ample space for apps, media, and files.<br><br>The device unfolds to reveal a stunning 7.6-inch Dynamic AMOLED 2X display with a resolution of 2208 x 1768 pixels. This foldable display, with a 120Hz refresh rate, not only provides an immersive viewing experience but also enhances the overall fluidity of the user interface. Whether you're enjoying multimedia content on the expansive screen or navigating the device in its folded state, the Z Fold 3 delivers a versatile and dynamic user experience.<br><br>One of the standout features of the Galaxy Z Fold 3 is its Flex Mode, which allows the device to be used in various configurations, adapting to different scenarios. Flex Mode enhances the user experience by optimizing app interfaces and providing a more comfortable and efficient way to interact with the device.<br><br>The Galaxy Z Fold 3 supports the S Pen, bringing the precision and functionality of Samsung's stylus to the foldable form factor. Whether you're taking notes, sketching, or editing documents, the S Pen on the Z Fold 3 provides a powerful tool for productivity and creativity.<br><br>In the camera department, the Z Fold 3 boasts a versatile triple-camera system. The 12MP wide-angle lens, 12MP ultra-wide lens, and 12MP telephoto lens deliver high-quality shots, adapting to different shooting scenarios. The under-display 4MP camera ensures a seamless and unobtrusive experience when using the device in its folded state. The Z Fold 3 supports 4K video recording, allowing users to capture stunning videos with ease.",
    "amount": 559,
    "base": "USD",
    "quantity": 15
  },
  {
    "Company": "Samsung",
    "modelName": "Z Flip 3",
    "imageUrl": "https://m.media-amazon.com/images/I/71f2I8cltBL._SL1500_.jpg",
    "addImageUrl": "https://m.media-amazon.com/images/I/71f2I8cltBL._AC_UY218_.jpg",
    "description": "The Samsung Galaxy Z Flip 3 is a stylish and compact foldable smartphone that marries sleek design with cutting-edge technology, offering a unique and convenient form factor. As the latest iteration in the Galaxy Z Flip series, the Z Flip 3 epitomizes Samsung's commitment to innovation and delivering a fresh approach to smartphone design.<br><br>At the heart of the Galaxy Z Flip 3 is the Qualcomm Snapdragon 888 processor, a powerful chipset that ensures responsive performance and seamless multitasking. With 8GB of RAM, the device effortlessly handles everyday tasks, from messaging and browsing to running demanding applications. The Z Flip 3 provides 128GB or 256GB of internal storage, offering users ample space for apps, photos, and files.The foldable 6.7-inch Dynamic AMOLED display with a resolution of 2640 x 1080 pixels is a standout feature of the Z Flip 3. The foldable screen not only provides an immersive viewing experience when unfolded but also allows the device to be compact and pocketable when folded. The 120Hz refresh rate enhances the overall fluidity of the user interface, making interactions smooth and responsive.The Galaxy Z Flip 3's clamshell design allows for convenient one-handed use, and its Flex Mode adapts the user interface when the device is partially folded, providing a tailored experience for specific applications. This flexibility adds a new dimension to how users interact with their smartphones, enhancing both convenience and functionality.<br><br>The external cover display is a 1.9-inch Super AMOLED panel, allowing users to check notifications, control music playback, and take quick selfies without unfolding the device. This secondary display adds to the Z Flip 3's convenience and usability.<br><br>In terms of camera capabilities, the Z Flip 3 features a dual-camera setup. The 12MP wide-angle lens and 12MP ultra-wide lens deliver versatile photography options, capturing both wide landscapes and detailed shots. The device supports 4K video recording, providing high-quality video capabilities in a compact and portable package.<br><br>Design plays a pivotal role in the Z Flip 3's appeal. The combination of glass and aluminum construction not only adds a premium feel but also contributes to the device's durability. The hinge mechanism has been enhanced, offering increased durability and allowing the device to stay open at various angles for hands-free use.",
    "amount": 500,
    "base": "USD",
    "quantity": 5
  },
  {
    "Company": "Samsung",
    "modelName": "A72",
    "imageUrl": "https://rukminim2.flixcart.com/image/416/416/kmf7ki80/mobile/4/o/f/galaxy-a72-sm-a725fzkhins-samsung-original-imagfb56prgkwxzt.jpeg?q=70",
    "addImageUrl": "https://rukminim2.flixcart.com/image/312/312/kmf7ki80/mobile/4/o/f/galaxy-a72-sm-a725fzkhins-samsung-original-imagfb56prgkwxzt.jpeg?q=70",
    "description": "The Samsung Galaxy A72 stands out as a compelling mid-range smartphone that seamlessly combines impressive features, a stylish design, and accessible pricing. As part of the Galaxy A series, the A72 caters to users who prioritize a well-rounded smartphone experience without compromising on essential features.<br><br>At the core of the Galaxy A72 is the Qualcomm Snapdragon 720G processor. Teaming up with 6GB or 8GB of RAM, this configuration ensures smooth and responsive performance, handling everyday tasks, apps, and multitasking with ease. The device offers generous storage options, with models providing either 128GB or 256GB of internal storage. Additionally, the inclusion of a microSD card slot allows users to expand storage based on their needs.<br><br>The Galaxy A72 boasts a vibrant 6.7-inch Super AMOLED display with a Full HD+ resolution. Renowned for its rich colors and deep blacks, the Super AMOLED technology enhances the overall visual experience, whether you're streaming content, browsing the web, or enjoying mobile games. The 90Hz refresh rate contributes to a smoother interface, ensuring a more responsive and enjoyable user experience.<br><br>Photography enthusiasts will appreciate the A72's versatile quad-camera system. The 64MP main camera captures detailed and sharp images, while the 12MP ultra-wide camera expands the field of view for stunning landscape shots. The 8MP telephoto camera, equipped with 3x optical zoom, allows users to get closer to their subjects without compromising image quality. The 5MP macro camera adds a creative touch, enabling close-up photography of intricate details. The camera system is complemented by a 32MP front-facing camera for high-quality selfies.<br><br>Design-wise, the Galaxy A72 features a sleek and modern aesthetic. The plastic back panel is stylishly crafted, and the camera module is seamlessly integrated, contributing to a clean and cohesive look. The device is available in various attractive colors, allowing users to choose a variant that suits their personal style.<br><br>Running on Samsung's One UI, based on Android, the Galaxy A72 provides a user-friendly and feature-rich interface. Samsung's software enhancements, combined with regular updates, ensure a smooth and secure user experience. Features like Samsung Knox add an extra layer of security to protect user data.",
    "amount": 469,
    "base": "USD",
    "quantity": 32
  }
]